; domain
(define (domain healthcare-delivery)

  (:requirements :strips :typing)

  (:types
    robot box content location patient - object
    delivery-robot escort-robot - robot
  )

  (:predicates

    ;; --- Location & Connection ---
    (at ?x - object ?l - location)
    (connected ?from - location ?to - location)
    (not-warehouse ?l - location)

    ;; --- Box State ---
    (has-content ?b - box  ?c - content)
    (empty ?b - box)
    
    ;; --- Robot state ---
    (carrying ?r - delivery-robot ?b - box)
    (accompanying ?r - escort-robot ?p - patient)
    (empty-handed ?r - robot)
  )

  ;; --- ACTIONS ---

  ;; Robot Movement
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (connected ?from ?to)
    )
    :effect (and
      (at ?r ?to)
      (not (at ?r ?from))
    )
  )

  ;; Carrying a box
  (:action pickup-box
    :parameters (?r - delivery-robot ?b - box ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (empty-handed ?r)
    )
    :effect (and
      (carrying ?r ?b)
      (not (empty-handed ?r))
      (not (at ?b ?l))
    )
  )

  ;; Drop a box
  (:action drop-box
    :parameters (?r - delivery-robot ?b - box ?l - location)
    :precondition (and
      (carrying ?r ?b)
      (at ?r ?l)
    )
    :effect (and
      (at ?b ?l)
      (not (carrying ?r ?b))
      (empty-handed ?r)
    )
  )

  ;; Fill box with content not in the warehouse (limited supply)
  (:action fill-box
    :parameters (?r - delivery-robot ?b - box ?c - content ?l - location)
    :precondition (and 
      (at ?r ?l)
      (at ?b ?l)
      (at ?c ?l)
      (empty ?b)
      (empty-handed ?r)
      (not-warehouse ?l)
    )
    :effect (and 
      (has-content ?b ?c)
      (not (empty ?b))
      (not (at ?c ?l))
    )
  )
  
  ;; Fill box with content in the warehouse (infinite supply)
  (:action fill-box-warehouse
    :parameters (?r - delivery-robot ?b - box ?c - content ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (at ?c ?l)
      (empty ?b)
      (empty-handed ?r)
    )
    :effect (and
      (has-content ?b ?c)
      (not (empty ?b))
    )
  )

  ;; Empty box at medical unit
  (:action empty-box
    :parameters (?r - delivery-robot ?b - box ?c - content ?l - location)
    :precondition (and
      (has-content ?b ?c)
      (at ?r ?l)
      (at ?b ?l)
    )
    :effect (and
      (at ?c ?l)
      (empty ?b)
      (not (has-content ?b ?c))
    )
  )

  ;; Escorting patients
  (:action pickup-patient
    :parameters (?r - escort-robot ?p - patient ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?p ?l)
      (empty-handed ?r)
    )
    :effect (and
      (accompanying ?r ?p)
      (not (empty-handed ?r))
    )
  )

  (:action drop-patient
    :parameters (?r - escort-robot ?p - patient ?l - location)
    :precondition (and
      (accompanying ?r ?p)
      (at ?r ?l)
    )
    :effect (and
      (at ?p ?l)
      (not (accompanying ?r ?p))
      (empty-handed ?r)
    )
  )
)

; problem
(define (problem healthcare-problem-1)
  (:domain healthcare-delivery)

  ;; OBJECTS
  (:objects
    ;; Locations (unit14 unit 4 at facility 1)
    central-warehouse entrance facility1 facility2 unit11 unit12 unit13 unit14 unit21 unit22 unit23 unit24 - location

    ;; Robots
    boxbot1 - delivery-robot
    patientbot1 - escort-robot

    ;; Contents
    scalpel tongue-depressor aspirin - content

    ;; Boxes
    box1 box2 - box

    ;; Patients
    alice bob - patient
  )

  ;; INITIAL STATE
  (:init
    (not-warehouse entrance)
    (not-warehouse facility1)
    (not-warehouse facility2)
    (not-warehouse unit11)
    (not-warehouse unit12)
    (not-warehouse unit13)
    (not-warehouse unit14)
    (not-warehouse unit21)
    (not-warehouse unit22)
    (not-warehouse unit23)
    (not-warehouse unit24)

    ;; Connections
    (connected central-warehouse entrance)
    (connected entrance central-warehouse)
    (connected entrance facility1)
    (connected facility1 entrance)

    (connected facility1 unit11)
    (connected facility1 unit12)
    (connected facility1 unit13)
    (connected facility1 unit14)
    (connected unit11 facility1)
    (connected unit12 facility1)
    (connected unit13 facility1)
    (connected unit14 facility1)

    (connected facility2 unit21)
    (connected facility2 unit22)
    (connected facility2 unit23)
    (connected facility2 unit24)
    (connected unit21 facility2)
    (connected unit22 facility2)
    (connected unit23 facility2)
    (connected unit24 facility2)

    (connected facility1 facility2)
    (connected facility2 facility1)

    ;; Robots initial position
    (at boxbot1 central-warehouse)
    (at patientbot1 entrance)

    (empty-handed boxbot1)
    (empty-handed patientbot1)

    ;; Boxes
    (at box1 central-warehouse)
    (at box2 central-warehouse)
    (empty box1)
    (empty box2)

    ;; Contents
    (at scalpel central-warehouse)
    (at aspirin central-warehouse)
    (at tongue-depressor central-warehouse)
    
    ;; Patients
    (at alice entrance)
    (at bob entrance)
  )

  ;; GOALS
  (:goal (and
    (at scalpel unit11)
    (at scalpel unit13) 
    (at aspirin unit21)
    (at tongue-depressor unit22)
    (at alice unit11)
    (at bob unit24)
  ))
)

; plan
1. (pickup-patient patientbot1 alice entrance)
   deleted: (empty-handed patientbot1)
   added: (accompanying patientbot1 alice)
   goals met: 0 of 6
2. (move patientbot1 entrance facility1)
   deleted: (at patientbot1 entrance)
   added: (at patientbot1 facility1)
   goals met: 0 of 6
3. (move patientbot1 facility1 unit11)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 unit11)
   goals met: 0 of 6
4. (drop-patient patientbot1 alice unit11)
   deleted: (accompanying patientbot1 alice)
   added: (at alice unit11) (empty-handed patientbot1)
   goals met: 1 of 6
5. (move patientbot1 unit11 facility1)
   deleted: (at patientbot1 unit11)
   added: (at patientbot1 facility1)
   goals met: 1 of 6
6. (move patientbot1 facility1 entrance)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 entrance)
   goals met: 1 of 6
7. (pickup-patient patientbot1 bob entrance)
   deleted: (empty-handed patientbot1)
   added: (accompanying patientbot1 bob)
   goals met: 1 of 6
8. (move patientbot1 entrance facility1)
   deleted: (at patientbot1 entrance)
   added: (at patientbot1 facility1)
   goals met: 1 of 6
9. (move patientbot1 facility1 facility2)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 facility2)
   goals met: 1 of 6
10. (move patientbot1 facility2 unit24)
   deleted: (at patientbot1 facility2)
   added: (at patientbot1 unit24)
   goals met: 1 of 6
11. (drop-patient patientbot1 bob unit24)
   deleted: (accompanying patientbot1 bob)
   added: (at bob unit24) (empty-handed patientbot1)
   goals met: 2 of 6
12. (fill-box-warehouse boxbot1 box2 scalpel central-warehouse)
   deleted: (empty box2)
   added: (has-content box2 scalpel)
   goals met: 2 of 6
13. (pickup-box boxbot1 box2 central-warehouse)
   deleted: (empty-handed boxbot1) (at box2 central-warehouse)
   added: (carrying boxbot1 box2)
   goals met: 2 of 6
14. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 2 of 6
15. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 2 of 6
16. (move boxbot1 facility1 unit11)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 unit11)
   goals met: 2 of 6
17. (drop-box boxbot1 box2 unit11)
   deleted: (carrying boxbot1 box2)
   added: (at box2 unit11) (empty-handed boxbot1)
   goals met: 2 of 6
18. (empty-box boxbot1 box2 scalpel unit11)
   deleted: (has-content box2 scalpel)
   added: (at scalpel unit11) (empty box2)
   goals met: 3 of 6
19. (fill-box-warehouse boxbot1 box2 scalpel unit11)
   deleted: (empty box2)
   added: (has-content box2 scalpel)
   goals met: 3 of 6
20. (pickup-box boxbot1 box2 unit11)
   deleted: (empty-handed boxbot1) (at box2 unit11)
   added: (carrying boxbot1 box2)
   goals met: 3 of 6
21. (move boxbot1 unit11 facility1)
   deleted: (at boxbot1 unit11)
   added: (at boxbot1 facility1)
   goals met: 3 of 6
22. (move boxbot1 facility1 unit13)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 unit13)
   goals met: 3 of 6
23. (drop-box boxbot1 box2 unit13)
   deleted: (carrying boxbot1 box2)
   added: (at box2 unit13) (empty-handed boxbot1)
   goals met: 3 of 6
24. (empty-box boxbot1 box2 scalpel unit13)
   deleted: (has-content box2 scalpel)
   added: (at scalpel unit13) (empty box2)
   goals met: 4 of 6
25. (move boxbot1 unit13 facility1)
   deleted: (at boxbot1 unit13)
   added: (at boxbot1 facility1)
   goals met: 4 of 6
26. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 4 of 6
27. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 4 of 6
28. (fill-box-warehouse boxbot1 box1 aspirin central-warehouse)
   deleted: (empty box1)
   added: (has-content box1 aspirin)
   goals met: 4 of 6
29. (pickup-box boxbot1 box1 central-warehouse)
   deleted: (empty-handed boxbot1) (at box1 central-warehouse)
   added: (carrying boxbot1 box1)
   goals met: 4 of 6
30. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 4 of 6
31. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 4 of 6
32. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 4 of 6
33. (move boxbot1 facility2 unit21)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit21)
   goals met: 4 of 6
34. (drop-box boxbot1 box1 unit21)
   deleted: (carrying boxbot1 box1)
   added: (at box1 unit21) (empty-handed boxbot1)
   goals met: 4 of 6
35. (empty-box boxbot1 box1 aspirin unit21)
   deleted: (has-content box1 aspirin)
   added: (at aspirin unit21) (empty box1)
   goals met: 5 of 6
36. (pickup-box boxbot1 box1 unit21)
   deleted: (empty-handed boxbot1) (at box1 unit21)
   added: (carrying boxbot1 box1)
   goals met: 5 of 6
37. (move boxbot1 unit21 facility2)
   deleted: (at boxbot1 unit21)
   added: (at boxbot1 facility2)
   goals met: 5 of 6
38. (move boxbot1 facility2 facility1)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 facility1)
   goals met: 5 of 6
39. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 5 of 6
40. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 5 of 6
41. (drop-box boxbot1 box1 central-warehouse)
   deleted: (carrying boxbot1 box1)
   added: (at box1 central-warehouse) (empty-handed boxbot1)
   goals met: 5 of 6
42. (fill-box-warehouse boxbot1 box1 tongue-depressor central-warehouse)
   deleted: (empty box1)
   added: (has-content box1 tongue-depressor)
   goals met: 5 of 6
43. (pickup-box boxbot1 box1 central-warehouse)
   deleted: (empty-handed boxbot1) (at box1 central-warehouse)
   added: (carrying boxbot1 box1)
   goals met: 5 of 6
44. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 5 of 6
45. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 5 of 6
46. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 5 of 6
47. (move boxbot1 facility2 unit22)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit22)
   goals met: 5 of 6
48. (drop-box boxbot1 box1 unit22)
   deleted: (carrying boxbot1 box1)
   added: (at box1 unit22) (empty-handed boxbot1)
   goals met: 5 of 6
49. (empty-box boxbot1 box1 tongue-depressor unit22)
   deleted: (has-content box1 tongue-depressor)
   added: (at tongue-depressor unit22) (empty box1)
   goals met: 6 of 6
